Revit 2027 API
ElementIdParameterValue(ElementId) Constructor
 Value constructor
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementIdParameterValue(
	ElementId value
)
Public Sub New (
	value As ElementId
)
public:
ElementIdParameterValue(
	ElementId^ value
)
new :
        value : ElementId -> ElementIdParameterValue
Parameters
value ElementId
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ElementIdParameterValue Class
ElementIdParameterValue Overload
Autodesk.Revit.DB Namespace